; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	image2 - mode
	thermograph3 - mode
	thermograph4 - mode
	image1 - mode
	thermograph0 - mode
	Star2 - direction
	Star0 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 thermograph4)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 thermograph0)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument2 thermograph0)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 Star0)
	(supports instrument4 image1)
	(supports instrument4 thermograph4)
	(supports instrument4 thermograph3)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon10)
	(supports instrument5 image2)
	(supports instrument5 image1)
	(supports instrument5 thermograph4)
	(calibration_target instrument5 GroundStation3)
	(supports instrument6 image1)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 GroundStation3)
	(supports instrument7 image1)
	(supports instrument7 thermograph3)
	(supports instrument7 thermograph4)
	(calibration_target instrument7 GroundStation4)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation4)
	(supports instrument8 image2)
	(supports instrument8 image1)
	(supports instrument8 thermograph3)
	(calibration_target instrument8 GroundStation4)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon7)
)
(:goal (and
	(pointing satellite2 Star6)
	(have_image Star5 thermograph4)
	(have_image Star6 image1)
	(have_image Phenomenon7 image1)
	(have_image Planet8 thermograph0)
	(have_image Star9 thermograph3)
	(have_image Phenomenon10 thermograph0)
	(have_image Star11 image1)
	(have_image Star12 thermograph4)
))

)

; plan
1. (switch_on instrument7 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument7)
   goals met: 0 of 9
2. (calibrate satellite2 instrument7 groundstation4)
   added: (calibrated instrument7)
   goals met: 0 of 9
3. (turn_to satellite2 star5 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 star5)
   goals met: 0 of 9
4. (take_image satellite2 star5 instrument7 thermograph4)
   added: (have_image star5 thermograph4)
   goals met: 1 of 9
5. (turn_to satellite2 star12 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 star12)
   goals met: 1 of 9
6. (take_image satellite2 star12 instrument7 thermograph4)
   added: (have_image star12 thermograph4)
   goals met: 2 of 9
7. (turn_to satellite2 star11 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 star11)
   goals met: 2 of 9
8. (take_image satellite2 star11 instrument7 image1)
   added: (have_image star11 image1)
   goals met: 3 of 9
9. (turn_to satellite2 phenomenon7 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 phenomenon7)
   goals met: 3 of 9
10. (turn_to satellite0 groundstation4 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 groundstation4)
   goals met: 3 of 9
11. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 9
12. (calibrate satellite0 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 3 of 9
13. (take_image satellite2 phenomenon7 instrument7 image1)
   added: (have_image phenomenon7 image1)
   goals met: 4 of 9
14. (turn_to satellite0 phenomenon10 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon10)
   goals met: 4 of 9
15. (take_image satellite0 phenomenon10 instrument1 thermograph0)
   added: (have_image phenomenon10 thermograph0)
   goals met: 5 of 9
16. (turn_to satellite0 planet8 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet8)
   goals met: 5 of 9
17. (take_image satellite0 planet8 instrument1 thermograph0)
   added: (have_image planet8 thermograph0)
   goals met: 6 of 9
18. (turn_to satellite2 star9 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 star9)
   goals met: 6 of 9
19. (take_image satellite2 star9 instrument7 thermograph3)
   added: (have_image star9 thermograph3)
   goals met: 7 of 9
20. (turn_to satellite2 star6 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 star6)
   goals met: 8 of 9
21. (take_image satellite2 star6 instrument7 image1)
   added: (have_image star6 image1)
   goals met: 9 of 9
